
&НаКлиенте
Процедура Расш5_ОстаткиТоваровПеред(Команда)
Объект.Остаток=Расш5_ОстаткиТоваров(Объект.Ссылка);  
Модифицированность=Истина; 
Если Объект.Остаток < 3 Тогда 
Элементы.ДекорацияОстаток.Видимость = Истина; 
Иначе 
Элементы.ДекорацияОстаток.Видимость = Ложь; 
	КонецЕсли;
КонецПроцедуры
&НаСервереБезКонтекста 
Функция Расш5_ОстаткиТоваров(ТоварСсылка) 
Запрос = Новый Запрос; 
Запрос.Текст = 
"ВЫБРАТЬ 
|	     ОстаткиТоваров.КоличествоОстаток 
| ИЗ 
|        РегистрНакопления.ОстаткиТоваров.Остатки( , Товар = &Товар) КАК ОстаткиТоваров"; 
Запрос.УстановитьПараметр("Товар", ТоварСсылка); 
Результат = Запрос.Выполнить(); 
Если Результат.Пустой() Тогда 
Возврат 0; 
КонецЕсли; 
Остатки = Результат.Выбрать(); 
Остатки.Следующий(); 
Остаток = Остатки.КоличествоОстаток; 
Возврат Остаток;   
КонецФункции