&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура Расш4_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СписокДолжностей = Элементы.Должность.СписокВыбора; 
СписокДолжностей.Добавить("Бухгалтер"); 
СписокДолжностей.Добавить("Экономист"); 
КонецПроцедуры

&НаСервере
Процедура Расш4_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
СписокДолжностей = Элементы.Должность.СписокВыбора; 
СписокДолжностей.Добавить("Бухгалтер"); 
СписокДолжностей.Добавить("Экономист"); 
КонецПроцедуры

&НаСервере
Процедура Расш4_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
СписокДолжностей=Элементы.Должность.СписокВыбора; 
Должность = СписокДолжностей.НайтиПоЗначению("Экономист"); 
Если Должность <> Неопределено Тогда 
СписокДолжностей.Удалить(Должность);  
	КонецЕсли; 
КонецПроцедуры
