Функция Цена(Ссылка) Экспорт 
    
    Запрос = Новый Запрос; 
    Запрос.Текст =  
    "ВЫБРАТЬ 
    |   Номенклатура.А1_Цена КАК А1_Цена 
    |ИЗ 
    |   Справочник.Номенклатура КАК Номенклатура 
    |ГДЕ 
    |   Номенклатура.Ссылка = &Ссылка"; 
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка); 
    РезультатЗапроса = Запрос.Выполнить(); 
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
        Возврат ВыборкаДетальныеЗаписи.А1_Цена; 
    КонецЦикла; 
    
    Возврат 0; // Если ничего не найдено
    
КонецФункции